app/Http/Controllers/User/UserFinishController.php

    public function read() {

        return view('user.component.data_finish')->with([
            // 'data' => Order::where('status', 'Finish')->orderBy('id','desc')->get()
            'data' => DB::table('orders')->where('status', 'Finish')->orderBy('id', 'desc')->get()
        ]);
---
select * from `orders` where `status` = 'Finish' order by `id` desc