app/Http/Controllers/ProductController.php

select * from `products` order by `id` desc
---
    public function read_product()
    {
        return view('user.component.data_product_guest')->with([
            'data' => DB::table('products')->orderBy('id', 'desc')->get()
        ]);

select * from `products` where `name` LIKE '%r%'
---
    public function search(Request $request)
    {

        if (!empty($request->query)) {
            $query = $request->input('query')??'';
            $products = Product::where('name', 'LIKE', '%'.$query.'%')->get();