app/Http/Controllers/Admin/AdminDashboardController.php

    public function getProducts()
    {
        $products = DB::table('products')
        ->orderBy('id', 'desc')
        ->get();
---
select * from `products` order by `id` desc

    public function store(Request $request)
    {
        // Validasi input
        $request->validate([
            'name' => 'required|unique:products',
            'price' => 'required',
            'stock' => 'required',
            'category' => 'required',
            // 'size' => 'required',
            'image' => 'required|image|mimes:jpeg,jpg,png|max:2048'
        ]);

        // Simpan gambar ke direktori public/images
        $image = $request->file('image');
        $imageName = time() . '_' . $image->getClientOriginalName();
        $image->move(public_path('images'), $imageName);

        // Simpan data produk ke database
        $data = [
            'name' => $request->name,
            'price' => $request->price,
            'stock' => $request->stock,
            'category' => $request->category,
            'size' => $request->size,
            'image' => $imageName
        ];

        Product::create($data);
---
insert into `products` (`name`, `price`, `stock`, `category`, `size`, `image`, `updated_at`, `created_at`) values ('Fajar Sebastian', '25000000', '60', 'Tukang Saluran Air', '', '1717087167_logo.png', '2024-05-30 16:39:27', '2024-05-30 16:39:27')